poc-framework-spring/poc-framework-spring-10-webservices-soap/src/main/resources/soap-messages-samples/http-postman-sample.txt

POST /poker/services HTTP/1.1
Host: localhost:8080
Content-Type: text/xml
cache-control: no-cache
Postman-Token: 33a266a1-ee36-4dfb-a150-1ab3a463aab1
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:schemas="http://www.springinaction.com/poker/schemas">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <schemas:EvaluateHandRequest>
            <schemas:card>
                <schemas:suit>DIAMONDS</schemas:suit>
                <schemas:face>ACE</schemas:face>
            </schemas:card>
             <schemas:card>
                <schemas:suit>CLUBS</schemas:suit>
                <schemas:face>EIGHT</schemas:face>
            </schemas:card>
                        <schemas:card>
                <schemas:suit>CLUBS</schemas:suit>
                <schemas:face>KING</schemas:face>
            </schemas:card>
             <schemas:card>
                <schemas:suit>SPADES</schemas:suit>
                <schemas:face>KING</schemas:face>
            </schemas:card>
                        <schemas:card>
                <schemas:suit>HEARTS</schemas:suit>
                <schemas:face>KING</schemas:face>
            </schemas:card>
        </schemas:EvaluateHandRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>------WebKitFormBoundary7MA4YWxkTrZu0gW--